In [96]:
import pandas as pd

In [97]:
dict1= {'Name':['Priyang','Aadhya','Krishna','Vedant','Parshv',
               'Mittal','Archana'],
               'Marks':[98,89,99,87,90,83,99],
               'Gender':['Male','Female','Female','Male','Male',
                        'Female','Female']
            }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Display top 3 rows of the dataset

In [98]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

## Check last 3 rows of the dataset

In [99]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find shape of our dataset (No. of Rows & No. of Columns)

In [100]:
df1.shape

(7, 3)

In [101]:
print ('Number of Rows:',df1.shape[0])
print ('Number of Columns:',df1.shape[1])

Number of Rows: 7
Number of Columns: 3

## Get information about our dataset like total number of rows, total number of columns, Datatypes of each column and memory requirement

In [102]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## Check Null Values in the Dataset

In [103]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

## Get overall statistics about the dataframe

In [104]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [105]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find unique values from the Gender Column

In [106]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## Find the number of unique values from the Gender Column

In [107]:
df1['Gender'].nunique()

2

## Display count of unique values in Gender Column

In [108]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## Find total no. of students having marks between 90 to 100 (inclusive) using between method

In [109]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [110]:
len(df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)])

4

In [111]:
sum(df1['Marks'].between(90,100))

4

In [112]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Find Average Marks

In [113]:
df1['Marks'].mean()

92.14285714285714

## Apply Method

In [114]:
def marks(x):
    return x//2

In [115]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [116]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [117]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [118]:
df1['Name'].apply(len)

0    7
1    6
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## Map Function

In [119]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [120]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [121]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## Drop the Column(s)

In [122]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [123]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [124]:
df1.drop(['Male_Female','Half_marks'],axis=1, inplace=True)

In [125]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## Print name of columns

In [126]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [127]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## Sort the Dataframe as per the marks column

In [128]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [131]:
df1.sort_values(by=['Marks','Gender'], ascending=False)

      Name  Marks  Gender
2  Krishna     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## Display name & marks of female students

In [132]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [136]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99

In [139]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99